"""
- 파이썬의 주요 자료형에는 None, bool, 숫자형, 문자열, 리스트, 튜플, 집합, 딕셔너리가 있다.
- 리스트, 튜플, 집합, 딕셔너리는 이후의 목차에서 더 자세히 다룰 것이다.
"""


"""
TODO: 숫자형 - 정수형, 실수형, 2진수, 8진수, 16진수
"""

#1 . 정수형
a=123
a=-455
a=0

# 2. 실수형
a=1.2
a=-3.45

# 지수 표현 방식은 아래처럼 표현
a=4.24e10 # 42400000000.0
a=4.24E-10 # 4.24e-10


# 3. 8진수 - 0o또는 0O로 시작
a=0o177;
print(a) # 127


# 4. 16진수 - 0x또는 0X로 시작
a=0x8ff # 2303
print(a)


# ! 5. 2진수⭐ - 0b또는 0B로 시작
a = 0b1101  
print(a) # 13 



"""
TODO: 숫자형활용 위한 연산자
"""
# 사칙 연산자
a=3
b=4

print(a+b) # 7
print(a-b) # -1
print(a*b) # 12
print(a/b) # 0.75


# 제곱 연산자
print(a**b) # 81


# 나머지 연산자
print(7%3) # 1
print(3%7) # 3


# 몫 연산자
# ! 사칙 연산의 / 연산자와의 차이 알기
print(7//4) # 1


# 복합 연산자
a += 1  
print(a) # 4

a -= 1  
print(a) # 3

a *= 2  
print(a) # 6

a /= 2  
print(a) # 3.0

a //= 2  
print(a) # 1.0

a %= 2  
print(a) # 1.0

a **= 2  
print(a) # 1.0
